benchmark/scripts/poc_jmeter_2.yml
execution:
- concurrency: 1
  ramp-up: 1m
  hold-for: 1m
  scenario: simple

# scenarios:
#   simple:
#     think-time: 0.75
#     requests:
#     - http://blazedemo.com/
scenarios:
  simple:
    script: benchmark/scripts/poc_jmeter_2.jmx

modules:
  jmeter:
    path: benchmark/jmeter/apache-jmeter-5.0/bin/jmeter
    # download-link: https://archive.apache.org/dist/jmeter/binaries/apache-jmeter-5.0.zip
    version: 5.0  # minimal supported version of JMeter is 2.9
    force-ctg: true   # true by default
    detect-plugins: true
    plugins:
    - jpgc-json=2.2
    - jmeter-ftp
    - jpgc-casutg
    
reporting:
- module: final-stats
  summary: true  # overall samples count and percent of failures
  percentiles: false  # display average times and percentiles
  summary-labels: false # provides list of sample labels, status, percentage of completed, avg time and errors
  failed-labels: false  # provides list of sample labels with failures
  test-duration: true  # provides test duration

# modules:
#   console:
#     # disable console reporter
#     disable: false  # default: auto