benchmark/scripts/poc_jmeter_2.yml
execution:
- concurrency: 1
  # ramp-up: 1m
  hold-for: 1m
  scenario: simple

#part of poc
# scenarios:
#   simple:
#     think-time: 0.75
#     requests:
#     - http://blazedemo.com/

scenarios:
  simple:
    script: benchmark/scripts/poc_jmeter_2.jmx

modules:
  jmeter:
    path: benchmark/jmeter/apache-jmeter-5.0/bin/jmeter
    download-link: https://archive.apache.org/dist/jmeter/binaries/apache-jmeter-5.0.zip
    version: 5.0  # minimal supported version of JMeter is 2.9
    force-ctg: true   # true by default
    detect-plugins: false

  console: 
    disable: true 

settings: 
  artifacts-dir: benchmark/tmp
    
reporting:
- module: final_stats
  summary: true 
  percentiles: false  
  summary-labels: false 
  failed-labels: false  
  test-duration: true 
- module: passfail
  criteria:
    - avg-rt of health_check >0.1ms for 1s, stop as failed